In [1]:
import numpy as py
import pandas as pd

In [2]:
s1 = pd.Series([2,6,10],index=['a','b','c'])

In [4]:
s1[['a','c']]

a     2
c    10
dtype: int64

In [6]:
pd.Series({'a1':'Hello', 'b1': 7, 'c1':True})

a1    Hello
b1        7
c1     True
dtype: object

In [7]:
s1 = pd.Series([1,3,5], index=['a', 'b', 'c'])
s2 = pd.Series([2,7,9], index=['b', 'c', 'd'])

In [8]:
s1

a    1
b    3
c    5
dtype: int64

In [9]:
s2

b    2
c    7
d    9
dtype: int64

In [10]:
s1 * s2

a     NaN
b     6.0
c    35.0
d     NaN
dtype: float64

In [36]:
df = pd.DataFrame(data=[[2,4,6,-1],[3,-4,2,-1],[-10,3,5,-7]],columns=['C1','C2','C3','C4'], index=['R1','R2','R3'])

In [15]:
df.head(2)

    C1  C2  C3  C4
R1   2   4   6  -1
R2   3  -4   2  -1

In [16]:
df['newC'] = 7

In [37]:
df

    C1  C2  C3  C4
R1   2   4   6  -1
R2   3  -4   2  -1
R3 -10   3   5  -7

In [23]:
df.drop('newC', axis=1, inplace=True)

In [25]:
df.drop('R1', axis=0, inplace=True)

In [26]:
df

    C1  C2  C3  C4
R2   3  -4   2  -1
R3 -10   3   5  -7

In [29]:
df[['C2','C4']]

    C2  C4
R2  -4  -1
R3   3  -7

In [32]:
df.loc['R2',['C2','C3']]

C2   -4
C3    2
Name: R2, dtype: int64

In [35]:
df.iloc[1,1:3]

C2    3
C3    5
Name: R3, dtype: int64

In [38]:
df.index

Index(['R1', 'R2', 'R3'], dtype='object')

In [39]:
df.set_index('C3', inplace=True)

In [40]:
df

    C1  C2  C4
C3
6    2   4  -1
2    3  -4  -1
5  -10   3  -7